netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_getSelectValue_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header/>
   <soapenv:Body>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:method>getSelectValue</urn:method>
      <urn:warningAsError/>
      <urn:disableMandatoryCustomFieldValidation/>
      <urn:disableSystemNotesForCustomFields/>
      <urn:ignoreReadOnlyFields/>
      <urn:partnerId/>
      <urn:applicationId/>
      <urn:email>%s(email)</urn:email>
      <urn:password>%s(password)</urn:password>
      <urn:account>%s(account)</urn:account>
      <urn:roleInternalId/>
      <urn:roleExternalId/>
      <urn:roleType/>
      <urn:roleName/>
	  <urn:selectValue>
		<fieldDescription xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com">
	    	<platformCore:recordType>salesOrder</platformCore:recordType>
			<platformCore:sublist>itemList</platformCore:sublist>
	  		<platformCore:field>item</platformCore:field>
      	    <platformCore:filter operator="contains">
               	<platformCore:filterValue>ACC</platformCore:filterValue>
            </platformCore:filter>			
			<platformCore:filterByValueList>
		     	<platformCore:filterBy>
		      		<platformCore:field>entity</platformCore:field>
		      		<platformCore:internalId>%s(getSelectValueFilterByInternalId)</platformCore:internalId>
		     	</platformCore:filterBy>
		    </platformCore:filterByValueList>	   
	   	</fieldDescription>
	   <pageIndex>1</pageIndex>
     </urn:selectValue>
   </soapenv:Body>
</soapenv:Envelope>

